admin/app/controllers/empresas_controller.rb

SELECT `empresas`.* FROM `empresas`
---
  def index
    @empresas = Empresa.all

INSERT INTO `empresas` (`nome`, `endereco`, `telefone`, `email`, `facebook`, `instagram`, `youtube`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES ('Comê Uquê?', 'R. Pref. Délio Basílio Leal - Centro, Paracambi - RJ', '21971324591', 'contato@comeuque.com.br', 'comeuque', 'comeuque', 'comeuque', -22, -43, '2022-07-25 22:09:44.523571', '2022-07-25 22:09:44.523571')
---
  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save

UPDATE `empresas` SET `empresas`.`telefone` = '(21) 97132-4591', `empresas`.`updated_at` = '2022-07-26 00:36:33.943113' WHERE `empresas`.`id` = 1
---
  def update
    respond_to do |format|
      if @empresa.update(empresa_params)

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
---
    def set_empresa
      @empresa = Empresa.find(params[:id])