admin/app/controllers/grupos_controller.rb

  def index
    @grupos = Grupo.all
---
SELECT `grupos`.* FROM `grupos`

  def create
    @grupo = Grupo.new(grupo_params)

    respond_to do |format|
      if @grupo.save
---
INSERT INTO `grupos` (`descricao`, `created_at`, `updated_at`) VALUES ('Pizzas', '2022-07-26 01:04:22.261555', '2022-07-26 01:04:22.261555')

    def set_grupo
      @grupo = Grupo.find(params[:id])
---
SELECT `grupos`.* FROM `grupos` WHERE `grupos`.`id` = 1 LIMIT 1