admin/app/controllers/produtos_controller.rb

SELECT `produtos`.* FROM `produtos`
---
  def index
    @produtos = Produto.all

INSERT INTO `produtos` (`titulo`, `descricao`, `preco`, `grupo_id`, `ativo`, `created_at`, `updated_at`) VALUES ('Pizza quatro queijos', '', 28.0, 1, 1, '2022-07-26 01:04:57.090348', '2022-07-26 01:04:57.090348')
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE `produtos` SET `produtos`.`titulo` = 'Pizza Quatro Queijos', `produtos`.`updated_at` = '2022-07-26 01:10:15.108307' WHERE `produtos`.`id` = 1
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)

SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1
---
    def set_produto
      @produto = Produto.find(params[:id])