admin/app/controllers/sessions_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`email` = 'luiz@llkinformatica.com.br' LIMIT 1
---
    def create
      usuario = Usuario.find_by_email(sign_in_params[:email])