admin/app/controllers/slides_controller.rb

SELECT `slides`.* FROM `slides`
---
  def index
    @slides = Slide.all

INSERT INTO `slides` (`titulo`, `descricao`, `created_at`, `updated_at`) VALUES ('Slide 2', '', '2022-07-25 18:49:41.805463', '2022-07-25 18:49:41.805463')
---
  def create
    @slide = Slide.new(slide_params)

    respond_to do |format|
      if @slide.save

UPDATE `slides` SET `slides`.`updated_at` = '2022-07-26 10:59:41.856577' WHERE `slides`.`id` = 2
---
  def update
    respond_to do |format|
      if @slide.update(slide_params)

SELECT `slides`.* FROM `slides` WHERE `slides`.`id` = 2 LIMIT 1
---
    def set_slide
      @slide = Slide.find(params[:id])